#include "stdafx.h"
#include "Engine.h"
#include "utils.h"

#pragma region Classes & Structs
class Material {
public:
	const char* materialName;
};
typedef struct {
	float x;
	float y;
	float z;
}Vector3;
typedef struct {
	float x;
	float y;
}Vector2;
struct RefDef_t {
	int x;
	int y;
	int Width;						//0x8
	int Height;						//0xC
	Vector2 Fov;					//0x10
	Vector3 Origin;					//0x18
	Vector3 ViewAxis[3];				//0x24
	char _0x0048[0x24];				//0x48
	float ZoomProgress;				//0x6C
	char _0x0070[0x4ABC];			//0x70
	Vector3 ViewAngles;				//0x4B28
	char _0x4B34[0x30];				//0x4B34
	Vector2 WeaponViewAngle;		//0x4B68
}; 
struct clientInfo_t {
	int Valid;						//0x0
	char _0x0004[0x8];				//0x4
	char Name[0x20];				//0xC
	int Team;						//0x2C,
	char _0x0030[0x4];
	int Rank;
	int Prestige;
	char _0x003C[0x24];
	char Model[0x40];
	char HeadModel[0x40];
	char _0x00E0[0x3D0];
	int Attacking;
	char _0x04B4[0x4];
	int Zooming;
	char _0x04BC[0x60];
	int Weapon;
	char _0x0520[0x74];
};
struct cgArray_t {
	int commandtime;                //0x0
	char padding00[0x8];            //0x4
	int pm_flags;					//0xC
	char padding01[0xC];            //0x10
	Vector3 Origin;                  //0x1C
	char padding02[0x128];          //0x28
	int clientNum;					//0x150
	char padding03[0x4];            //0x154
	Vector3 viewAngles;				//0x158
	char padding04[0x38];			//0x164
	int Health;                     //0x19C   
	char padding08[0x4];			//0x1A0
	int MaxHealth;					//0x1A4
	char padding05[0x1D4];          //0x1A8
	float aimSpreadScale;           //0x37C
	char padding06[0x6B72C];        //0x380
	RefDef_t refdef_s;              //0x6BAAC
	char padding07[0x8D96C];		//0x7061C
	clientInfo_t clientInfo[18];	//0xFDF88 // + 0X48, 8263EE60
};
struct serverInfo_t {
	char _0x0000[0x24];				//0x0
	char Gametype[0x20];			//0x24 
	char HostName[0x20];			//0x44 
	char _0x0064[0xE4];				//0x64
	int MaxClients;					//0x148 
	int PrivateClients;				//0x14C 
	char _0x0150[0x8];				//0x150
	char Mapname[0x34];				//0x158 
};
struct Centity_t {
	char _0x0000[0x2];				//0x0
	char Alive;						//0x2 
	char _0x0003[0x11];				//0x3
	Vector3 Origin;					//0x14 
	Vector3 Angles;					//0x20 
	char _0x002C[0x30];				//0x2C
	int Flags;						//0x5C 
	char _0x0060[0x64];				//0x60
	int Handle;						//0xC4
	EntityType_t Type;				//0xC8
	char _0x00CC[0x88];				//0xCC
	int ClientNumber;				//0x154 
	char _0x0158[0x34];				//0x158
	int WeaponIndex;				//0x18C 
	char _0x0190[0x5C];				//0x190
	//(0x826436B8 + (i * 0x1EC)) + 0x18C
};
struct usercmd_s {
	int time; //0-4
	unsigned int button; //4-8
	Vector3 viewAngles; //8-14
	int weapon; //14 - 18
	int offHand; //18-1c
	char forwardmove; //1c
	char rightmove; //1d
	unsigned short airburstMarkDistance; //1E - 20
	unsigned short meleeChargeEnt; //20 - 22
	char meleeChargeDist; //22
	char selectedLoc[2]; //23 - 25
	char selectedLocAngle; //26
	unsigned short sightedClientsMask; //26 - 2A
	unsigned short spawnTraceEntIndex; //2A - 2C
};
struct clientActive_t {
	bool usingAds;
	char padding00[0xDF];			//0x1
	float BaseAngles[2];			//0xE0
	char paddig00[0x34C8];			//0xE8
	float ViewAngles[2];			//0x35B0
	char padding01[0x4];			//0x35B8
	usercmd_s Usercmd[128];			//0x35BC
	int curCmd;						//0x4BBC

	usercmd_s* getCmd(int cmdNum) {
		return &Usercmd[cmdNum & 0x7F];
	}
};
struct WeaponDef {
	char* weaponName; //0x0
	char _0x4[0x80]; //0x4
	Material* killIcon; //0x84
};

struct RGBA {
	int r;
	int g;
	int b;
	int a;
};
class CRadarHud
{
public:
	float x;
	float y;
	float w;
	float h;
	char _0x0010[12];
};

RGBA rgba(int r, int g, int b, int a) {
	RGBA clrTmp = { r,g,b,a };
	return clrTmp;
}
RGBA MenuColor = { 17, 99, 222, 255 };

CRadarHud radarhud; 
cgArray_t* cg_t;
serverInfo_t* cgs_t;
Centity_t* centity;
clientActive_t* active;

struct UIItems {
	int currentOption;
	int maxOptions;
	int optionCount;
	int submenu;
	int submenuLevel;
	int lastSubmenu[20];
	int lastOption[20];
	bool optionPress;
	bool leftPress;
	bool rightPress;
}UIItems;
#pragma endregion

struct Toggles {
	bool ClosestPlayerIsReadyForUberHax;
	int SelectedPlayer;

	bool ESP_Required;
	bool ESP_Name;
	bool ESP_RedBoxes;
	bool ESP_WeaponIcon;
	bool ESP_Bone;
	bool ESP_2DBox;
	bool ESP_3DBox;
	bool ESP_Snaplines;
	int ESP_Snaplines_Type;//0 = center, 1 = top, 2 = bottom

	bool Wallhack;
	bool NoRecoil;
	bool UnlimitedUAV;
	bool Laser;
	bool NoSpread;

